# Median

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('C:/Users/Swapnil/Desktop/Python Programs/InternShala - Data Science Python/Module - 3 - Statistics/Module 3 - Datasheets/Median.csv')
df

    Student  Overall Marks  Gender    Subject
0     Anish           9700    Male    English
1   Rishabh             83    Male    English
2      Ajay             78    Male    Physics
3   Abhinav             86    Male  Chemistry
4    Anurag             91    Male    English
..      ...            ...     ...        ...
95  Aaditya             77    Male  Chemistry
96    vivek             55    Male    Physics
97    Tisha              7  Female    English
98   Raghav             73    Male    English
99   Ishita             82  Female  Chemistry

[100 rows x 4 columns]

In [4]:
df.head()

   Student  Overall Marks Gender    Subject
0    Anish           9700   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [3]:
df['Overall Marks']

0     9700
1       83
2       78
3       86
4       91
      ...
95      77
96      55
97       7
98      73
99      82
Name: Overall Marks, Length: 100, dtype: int64

In [5]:
df[df['Overall Marks'] == 83]

     Student  Overall Marks Gender    Subject
1    Rishabh             83   Male    English
6      Varun             83   Male  Chemistry
50  Shashank             83   Male  Chemistry
61     krish             83   Male    English

In [7]:
df[df['Overall Marks'] <= 40 ]

      Student  Overall Marks  Gender    Subject
5       Ajeet             15    Male    Physics
12       manu             20    Male    Physics
16   Prashant             21    Male    Physics
17      Kunal             15    Male    Physics
20      shaan             18    Male  Chemistry
29      Sumit             19    Male    Physics
37  Siddharth             18    Male  Chemistry
40    anamika             23  Female    English
42   krithika              5  Female    Physics
59      gokul             40    Male  Chemistry
71     simran              0  Female    Physics
83     dinesh             18    Male    Physics
93      ankur             17    Male  Chemistry
94     Smriti              0  Female  Chemistry
97      Tisha              7  Female    English

In [9]:
df['Overall Marks'].mean()

164.24

In [11]:
df['Overall Marks'].mode()

0    88
dtype: int64

In [12]:
df['Overall Marks'].median()

77.0

## Calculating quantiles

In [13]:
#Calculating Quantiltes. Remember Quantiles are 1/4th of quartiles.
Q1 = df['Overall Marks'].quantile(0.25)
print ("First Quartile", Q1)

First Quartile 57.25

In [15]:
Q2 = df['Overall Marks'].quantile(0.5)
Q3 = df['Overall Marks'].quantile(0.75)
Q4 = df['Overall Marks'].quantile(1)

print ("Second Quartile", Q2)
print ("Third Quartile", Q3)
print ("Fourth Quartile", Q4)

Second Quartile 77.0
Third Quartile 87.25
Fourth Quartile 9700.0

In [16]:
whole_num = pd.DataFrame({'Whole Numbers': [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]})
whole_num

    Whole Numbers
0               0
1               1
2               2
3               3
4               4
5               5
6               6
7               7
8               8
9               9
10             10
11             11
12             12
13             13
14             14
15             15
16             16
17             17
18             18
19             19

In [17]:
whole_num['Whole Numbers'].median()

9.5

## IQR

In [18]:
max_data = df['Overall Marks'].max()
max_data

9700

In [19]:
min_data  = df['Overall Marks'].min()
min_data

0

In [20]:
range_marks = max_data - min_data
range_marks

9700

#### Calculating IQR requires calculating 1st and 3rd quartiles

In [22]:
#We already have 1st and 3rd quartiles :
print(Q1)
print(Q3)

57.25
87.25

In [24]:
IQR = Q3 - Q1
IQR

30.0

In [25]:
ef = pd.DataFrame({'Set':[37, 42, 48, 51, 52, 53, 54, 55]})
ef

   Set
0   37
1   42
2   48
3   51
4   52
5   53
6   54
7   55

In [26]:
q3 = ef['Set'].quantile(0.75)
q3

53.25